Revit 2027 API
AnalysisDisplayLegendSettings.ColorRangeWidth Property
 Width of color range (for Colored Surface, Markers and Text, and Vector display). Measured in paperspace units.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ColorRangeWidth { get; set; }
Public Property ColorRangeWidth As Integer
	Get
	Set
public:
property int ColorRangeWidth {
	int get ();
	void set (int value);
}
member ColorRangeWidth : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentsInconsistentException |  When setting this property: colorRangeWidth is greater than 10000 or less than 0
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace